// 插件信息
constexpr auto Configuration = R"CFG(
{
    "插件名称": "dicebot",
    "插件作者": "dynilath",
    "插件版本": "1.7.3",
    "插件说明": "a dicebot",
    "所需权限":
    {
        "输出日志": "<这里填写申请理由>",
        "发送好友消息": "<这里填写申请理由>",
        "发送群消息": "<这里填写申请理由>",
        "发送群临时消息" : "<这里填写申请理由>",
        "取群名片": "<这里填写申请理由>",
        "查询好友信息" : "<这里填写申请理由>",
        "取昵称_从缓存" : "<这里填写申请理由>",
        "强制取昵称" : "<这里填写申请理由>"
    }
}
 )CFG";

/*
所有权限列表（有感叹号的是危险权限！）

输出日志
发送好友消息
发送群消息
发送群临时消息
添加好友
添加群
删除好友！
置屏蔽好友！
置特别关心好友
发送好友xml消息
发送群xml消息
发送好友json消息
发送群json消息
上传好友图片
上传群图片
上传好友语音
上传群语音
上传头像！
设置群名片
取昵称_从缓存
强制取昵称
获取skey！
获取pskey！
获取clientkey！
取框架QQ
取好友列表
取群列表
取群成员列表
设置管理员
取管理层列表
取群名片
取个性签名
修改昵称！
修改个性签名！
删除群成员
禁言群成员
退群！
解散群！
上传群头像
全员禁言
群权限_发起新的群聊
群权限_发起临时会话
群权限_上传文件
群权限_上传相册
群权限_邀请好友加群
群权限_匿名聊天
群权限_坦白说
群权限_新成员查看历史消息
群权限_邀请方式设置
撤回消息_群聊
撤回消息_私聊本身
设置位置共享
上报当前位置
是否被禁言
处理好友验证事件
处理群验证事件
查看转发聊天记录内容
上传群文件
创建群文件夹
设置在线状态
QQ点赞！
取图片下载地址
记录致命错误
查询好友信息
查询群信息
框架重启！
群文件转发至群
群文件转发至好友
好友文件转发至好友
置群消息接收
取群名称_从缓存
发送免费礼物
取好友在线状态
取QQ钱包个人信息！
获取订单详情
提交支付验证码
领取红包
分享音乐
更改群聊消息内容！
更改私聊消息内容！
群聊口令红包
群聊拼手气红包
群聊普通红包
群聊画图红包
群聊语音红包
群聊接龙红包
群聊专属红包
好友口令红包
好友普通红包
好友画图红包
好友语音红包
好友接龙红包
*/
